package com.lf.zy;

/**
 * Created by Zy on 2019/6/10.
 *
 *  1.确认环境搭建
 *  2.任务分工完成：员工模块
 *  3.数据库设计建表完成
 *  4.框架搭建导出完成
 *  5.任务模块包结构创建完成
 *
 *
 *
 *  Created by Zy on 2019/6/11.
 *  1.写接口
 *  2.搭建员工前台
 *  3.完毕
 *
 *
 *   Created by Zy on 2019/6/12.
 *  1.员工信息模块逻辑删除，修改，查询，分页
 *  2.明日补上员工信息模块的导出（POI）
 *  3.明细编写添加员工信息模块
 *
 *
 *
 *  *   Created by Zy on 2019/6/13.
 *  1.添加员工信息模块基本完成
 *  2.未补上员工信息模块的导出（POI）
 *  3.明日计划修改登陆BUG
 *  4.修改新增模块的小BUG
 *  5.补上员工信息模块的POI
 *
 *
 *
 *   *  Created by Zy on 2019/6/14.
 *  1.添加员工信息模块基本完善
 *  2.员工登陆完成（权限，redis缓存）
 *  3.优化了员工信息的条件查询
 *  4.明日计划继续优化模块功能
 *  5.补上员工信息模块的POI
 *  6.明日完成拦截器
 *
 *
 *
 * *   *  Created by Zy on 2019/6/15.
 *  1.优化后台功能
 *  2.修改redis
 *  3.搭建前台模块
 *  4.明日休息
 *  5.明日加班
 *
 *
 *     *  Created by Zy on 2019/6/17.
 *  1.前台展示页面
 *  2.前台查询
 *  3.明日计划写前台
 *
 *
 *
 * *     *  Created by Zy on 2019/6/18.
 *  1.前台页面展示，条件查询完成
 *  2.前台展示差分页排序
 *  3.明日计划写前台分页排序
 *  4.详情后台完成
 *  5.完毕
 *
 *
 *
 *
 *   * *     *  Created by Zy on 2019/6/19.
 *  1.详情页完成
 *  2.展示页分页完成
 *  3.点击购买未完成
 *  4.明日上午计划完成购买
 *  5.完毕
 */

public class ZangYong {
    public static void main(String[] args) {
        System.out.println("张勇");
    }

}
