package com.lf.hyq;

/**
 * Created by monst on 2019/6/10.
 */
public class Daily {
    public static void main(String[] args) {
        System.out.println("日报");
    }
}
/*****
2019/6/10
     1.longfor-house项目大的框架搭建完成,svn连接测试成功
     2.后台大模块分工
     明：开始着手敲代码
2019/6/11
     1.发布租赁房源 发布销售房源的接口可用  有待优化
     2.查看房源列表完成   条件 分页
     3.解决组员一些思路问题
     明：房源删除 查询 修改
2019/6/12
     1.完成了增删改查
     条件查询有点问题
2019/6/13
      1.添加查询房源详情
      2.条件查询完善
      3.批量上传能上传，有bug
      4.批量显示
      明：
      5.完善批量上传
      6.开始前台
2019/6/14
      1.房源展示的优化
      2.完成一些前台所需接口
      3.解决图片上传的问题
      明：
      4.前台分工。开始一些业务

2019/6/15-16
      1.前台分工
      2.房源表从redis获取发布者
      3.房源展示优化
      明：
      4.前台指导，调整布局

2019/6/17
      1.前台模块梳理
      2.后台贯穿优化
      3.创建拦截器
      明：
      4.继续优化后台
      5.合理化拦截器
2019/6/18
      1.前台首页展示
      2.前台小优化
      3.分析逻辑思路
      明：
      4.拦截器升级
2019/6/19
      1.修改首页展示
      2.更换前台调用
      3.分析前台分页
      明：
      4.开展用户登录
      5.拦截器升级
2019/6/19
      1.用户登录注册
      2.整合小优化
      明：
      3.学习新的技术,项目暂缓
 *********/
