package com.lf.zgx;

/**
 * Created by ASUS on 2019/6/10.
 */
public class TextZgx {
    public static void main(String[] args) {
        System.out.println("张关宵");
    }

}
/*
* 2019/6/10.
* 确认表结构
* 环境搭建
* 通过svn更新，上传,下载项目，写测试文件，测试项目能否运行成功，上传同步组内的dome。框架正常运行
* 模块分配，确认每个人的模块，
* 根据确认好的模块，进行拆分模块接口，细分出这个模块下已知的所有接口。
*
*
* */
/*
* 2019/6/11.
* 租赁模块的查询、添加/
* 重新建立表结构，更改字段/
*
*
*
* */
/*
* 2019/6/12.
* 租赁模块的删除，的接口/
* 增加功能，查询功能，分页功能，删除共功能
* 修改功能有不能修改，能回显，
*
* 明天
*导出功能，全选反选，单条信息查看功能
*
*/
/*
* 2019/6/13.
* 修改功能，员工业绩模块
*
* 明天
*优化细节功能。例如导出
* 前台功能
*
*
*/
/*
* 2019/6/14.
* 1.员工业绩模块，添加查询sql
* 2.给租赁模块添加字段，员工姓名/电话
*3.优化员工业绩模块
* 4.租赁模块添加查询功能
* 明天
*优化细节功能。例如导出
* 前台功能
*
*
*/
/*
* 2019/6/15
* 1.租赁模块，导出表
* 2.了解到Mapper.xml中有多个入参的时候，就可以不给出入参路径
* 3.添加字段后重新完善增删改查
* 明天
*优化细节功能。例如导出
* 前台功能
*
*
*/
/*
* 2019/6/17
* 1.前台租赁模块，查询展示到页面
*
*
* 明天
*优化细节功能。
* 前台功能
*
*
*//*
* 2019/6/18
* 1.前台租赁模块，添加条件查询，功能完善
* 2.详情页展示

* 明天
*优化细节功能。
* 前台功能
*
*
*/
/*
* 2019/6/19
* 1.前台租赁模块，分页查询，价格排序
* 2.详情页展示完善

* 明天
* 租赁页面完成
*优化细节功能。
* 前台功能
*
*
*/