package com.lf.dgl;



/**
 * Created by 代光磊 on 2019/6/10.
 */
public class SellTest {

    public static void main(String[] args) {
        System.out.println("提交测试成功!!!");

    }



     /*
    *   2019-06-10  周一
    *       1 组内创建数据库表结构
    *       2 测试框架是否搭建成功
    *       3 测试SVN上传下载文件
    *       4 写销售模块接口文档
    *       5 组内分析可能出现的问题和声明注意事项
    * */

    /**
     *  2019-06-11 周二
     *      1 组内分析可能出现的问题
     *      2 写分页和条件查询 增加 根据ID查询 修改  逻辑删除接口
     *      3 列表在easyUI页面展示
     */

    /**
     *  2019-6-12 周三
     *      1 优化分页 条件查询
     *      2 增删查改在easyUI页面展示
     *      3 优化部分功能
     */

    /**
     *  2019-6-13 周四
     *      1 用户表的增删改查
     *      2 分页 条件查询和排序
     *      3 easyUI 展示
     *      4 明天计划:用户表 销售表POI导出
     *      5 增加修改图片功能
     *      6 根据组内安排 写前台页面
     */

    /**
     *  2019-6-14 周五
     *      1 销售表的增删改查优化
     *      2 用户表的增删改查优化
     *      3 前台显示页面优化
     *
     *
     */

    /**
     *  2019-6-15 周六
     *      1 页面优化
     *      2 前台模块分配
     *      3 用户图片上传
     *
     */

    /**
     *  2019-6-17 周一
     *      1 页面优化
     *      2 前台查询页面展示
     *      3 条件查询
     *
     */


    /**
     *  2019-6-18 周二
     *      1 页面优化
     *      2 前台实现分页 条件查询 排序
     *      3 前台点击房源标题 展示详情
     */

    /**
     *  2019-6-19 周三
     *      1 页面优化
     *      2 前台购买和优化
     *
     */
}
